Repository: Risk-Return/ETIC
Catalog: App/ETIC/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# board.changed
source: Changed
zh_hans: 变卦

# board.dayPillar
source: Day
zh_hans: 日

# board.disclaimer
source: For cultural entertainment only. Not scientific prediction.
zh_hans: 仅供文化娱乐，非科学预测。

# board.hourPillar
source: Hr
zh_hans: 时

# board.interpretation
source: Interpretation
zh_hans: 解读

# board.interpretationDesc
source: Submit this hexagram to a veteran Liuyao diviner for a detailed reading with multi-turn follow-up. The chart is fixed — the reading does not alter it.
zh_hans: 将此卦呈递资深六爻师傅进行详细解读，支持多轮追问。盘面不变 — 解读不会改动卦象。

# board.legend
source: ○ Old Yang (moving) × Old Yin (moving) Self/Other mark the subject Void marks the empty branch Flourishing/Waning/Ideal/Confined/Dead indicates monthly strength
zh_hans: ○ 老阳（动爻） × 老阴（动爻） 世/应标注主客 旬空标注空亡地支 旺/衰/相/囚/死表示月建旺衰

# board.lowerTrigramSuffix
source: lower
zh_hans: 下卦

# board.methodSuffix
source: cast
zh_hans: 起卦

# board.monthPillar
source: Mo
zh_hans: 月

# board.primary
source: Primary
zh_hans: 本卦

# board.question
source: Asked
zh_hans: 所问

# board.requestReading
source: Request Reading
zh_hans: 请求解读

# board.response
source: O
zh_hans: 应

# board.upperTrigramSuffix
source: upper
zh_hans: 上卦

# board.useGodHidden
source: Use God not found in primary hexagram (hidden line; seek elsewhere). Use as a reading hint.
zh_hans: 本卦中未找到用神（伏藏；宜另寻）。请作为解读参考。

# board.useGodPositionPrefix
source: Use God line positions:
zh_hans: 用神爻位：

# board.useGodTitle
source: Use God
zh_hans: 用神

# board.void
source: V
zh_hans: 空

# board.voidPrefix
source: Void:
zh_hans: 旬空：

# board.world
source: S
zh_hans: 世

# board.yearPillar
source: Yr
zh_hans: 年

# brand.tagline
source: Quiet your mind, focus on your question, then cast.
zh_hans: 静心凝神，专注于您的问题，然后开始起卦。

# casting.castButton
source: Cast
zh_hans: 起卦

# casting.categorySection
source: Category
zh_hans: 事项类别

# casting.disclaimer
source: For cultural entertainment only. Not scientific prediction. Do not use for medical, legal, or financial decisions.
zh_hans: 仅供文化娱乐，非科学预测。请勿用于医疗、法律或财务决策。

# casting.hint.coins
source: Shake your phone or tap the button — three coins settle six times, building the hexagram from bottom to top.
zh_hans: 摇动手机或点击按钮 — 三枚铜钱抛掷六次，从下往上逐爻排定。

# casting.hint.number
source: Plum Blossom method: take innate trigram from the upper and lower numbers; their sum determines the moving line.
zh_hans: 梅花易数：取上数字为外卦，下数字为内卦，两数之和定动爻。

# casting.hint.random
source: The system simulates a coin toss randomly for a quick experience.
zh_hans: 系统随机模拟铜钱起卦，快速体验。

# casting.hint.time
source: Plum Blossom time method: cast using the selected date's ganzhi and solar date.
zh_hans: 梅花易数时卦：按所选日期的干支及阳历日数起卦。

# casting.lowerNum
source: Lower
zh_hans: 下数

# casting.method.coins
source: Coins
zh_hans: 铜钱

# casting.method.manual
source: Manual
zh_hans: 手动

# casting.method.number
source: Number
zh_hans: 数字

# casting.method.random
source: Random
zh_hans: 随机

# casting.method.time
source: Time
zh_hans: 时间

# casting.methodSection
source: Casting Method
zh_hans: 起卦方法

# casting.questionPlaceholder
source: What would you like to ask?
zh_hans: 您想问什么？

# casting.questionSection
source: Your Question
zh_hans: 您的问题

# casting.timeSection
source: Time
zh_hans: 时间

# casting.upperNum
source: Upper
zh_hans: 上数

# category.career
source: Career
zh_hans: 事业

# category.general
source: General
zh_hans: 综合

# category.health
source: Health
zh_hans: 健康

# category.lawsuit
source: Lawsuit
zh_hans: 官非

# category.lost
source: Lost Item
zh_hans: 失物

# category.marriage
source: Marriage
zh_hans: 婚姻

# category.study
source: Study
zh_hans: 学业

# category.travel
source: Travel
zh_hans: 出行

# category.wealth
source: Wealth
zh_hans: 财运

# encyclopedia.disclaimer
source: Scripture from the public domain Zhouyi, for reference only.
zh_hans: 经文为公有领域《周易》原文，仅供查阅参考。

# encyclopedia.judgmentTitle
source: Judgment
zh_hans: 卦辞

# encyclopedia.linesTitle
source: Line Statements
zh_hans: 爻辞

# encyclopedia.missingData
source: Encyclopedia data missing. Please check bundled resources.
zh_hans: 百科数据缺失，请检查随包资源。

# encyclopedia.searchPrompt
source: Search hexagram or judgment
zh_hans: 搜卦名或卦辞

# encyclopedia.title
source: I Ching Encyclopedia
zh_hans: 卦象百科

# encyclopedia.tuanTitle
source: Tuan Commentary
zh_hans: 彖辞

# error.badURL
source: Invalid backend address.
zh_hans: 后端地址无效。

# error.calendarOutOfRange
source: Date is outside the supported range (1900–2100).
zh_hans: 日期超出支持范围（1900–2100）。

# error.httpError
source: Backend returned an error (HTTP %d).
zh_hans: 后端返回错误（HTTP %d）。

# error.invalidNumbers
source: Numbers must be positive integers.
zh_hans: 数字必须为正整数。

# history.allFilter
source: All
zh_hans: 全部

# history.continueAsk
source: Continue Asking
zh_hans: 继续询问

# history.corruptBoard
source: Hexagram data is corrupted and cannot be displayed.
zh_hans: 卦象数据损坏，无法显示。

# history.delete
source: Delete
zh_hans: 删除

# history.emptyDesc
source: Each cast is recorded here automatically. You can bookmark, review, and continue asking.
zh_hans: 每次起卦会自动记录在此。您可以收藏、回顾与继续询问。

# history.emptyTitle
source: No Records Yet
zh_hans: 暂无记录

# history.favorite
source: Favorite
zh_hans: 收藏

# history.favoritesFilter
source: Favorites
zh_hans: 收藏

# history.noQuestion
source: (No question recorded)
zh_hans: （未记录问题）

# history.noTranscript
source: No reading transcript yet.
zh_hans: 暂无解读记录。

# history.requestReadingFallback
source: Request Reading
zh_hans: 请求解读

# history.transcriptTitle
source: Reading Transcript
zh_hans: 解读记录

# history.unfavorite
source: Unfavorite
zh_hans: 取消收藏

# history.viewBoard
source: View Full Hexagram
zh_hans: 查看完整卦象

# interpret.masterLabel
source: Diviner
zh_hans: 师傅

# interpret.placeholder
source: Ask a follow-up question...
zh_hans: 追问…

# interpret.scriptureDisclaimer
source: Scripture is for reference only. The reading is based on the hexagram's Self/Other and Use God.
zh_hans: 经文仅供参考。断卦以盘面世应/用神为准。

# interpret.scriptureTitle
source: Scripture Reference
zh_hans: 经文参考

# interpret.thinking
source: Contemplating…
zh_hans: 凝神推演…

# location.apply
source: Apply
zh_hans: 应用

# location.choose
source: Choose city or longitude
zh_hans: 选择城市或输入经度

# location.customLabel
source: Custom longitude
zh_hans: 自定义经度

# location.customPlaceholder
source: e.g. 116.4 (East +, West −)
zh_hans: 例：116.4（东经正，西经负）

# location.customSection
source: Custom longitude
zh_hans: 自定义经度

# location.done
source: Done
zh_hans: 完成

# location.hint
source: True solar time shifts the divination hour to your local sun position by longitude. Optional — leave off to use your device's local time.
zh_hans: 真太阳时按经度将起卦时辰校正为当地太阳位置。可选 — 留空则使用设备本地时间。

# location.notSet
source: Device time — no correction
zh_hans: 设备时间 — 未校正

# location.pickerTitle
source: Casting Location
zh_hans: 起卦地点

# location.search
source: Search city or region
zh_hans: 搜索城市或地区

# location.section
source: Location (True Solar Time)
zh_hans: 地点（真太阳时）

# location.useDeviceTime
source: Use device time (no correction)
zh_hans: 使用设备时间（不校正）

# nav.board
source: Hexagram
zh_hans: 卦象

# nav.cast
source: Cast
zh_hans: 起卦

# nav.history
source: History
zh_hans: 历史

# nav.interpret
source: Reading
zh_hans: 解读

# nav.record
source: Record
zh_hans: 记录

# nav.settings
source: Settings
zh_hans: 设置

# ritual.allLinesDone
source: All six lines cast
zh_hans: 六爻排定

# ritual.beginCasting
source: Begin Casting
zh_hans: 开始起卦

# ritual.casting
source: Cast (%d/6)
zh_hans: 起卦中（%d/6）

# ritual.coinBack
source: H
zh_hans: 背

# ritual.coinChar
source: T
zh_hans: 字

# ritual.formingPlaceholder
source: Forming…
zh_hans: 成卦中…

# ritual.preparePrompt
source: Quiet your mind and focus on your question
zh_hans: 静心凝神，专注于您的问题

# ritual.shakePrompt
source: Shake your phone, or tap the button below to cast
zh_hans: 摇动手机，或点击下方按钮起卦

# ritual.skipAnimation
source: Skip
zh_hans: 跳过

# ritual.tapPrompt
source: Tap the button below to cast
zh_hans: 点击下方按钮起卦

# ritual.transformingTitle
source: Moving Lines
zh_hans: 动爻变换

# settings.animationSection
source: Animation
zh_hans: 动画

# settings.done
source: Done
zh_hans: 完成

# settings.haptics
source: Haptic Feedback
zh_hans: 触觉反馈

# settings.languageLabel
source: Interface Language
zh_hans: 界面语言

# settings.languageSection
source: Language
zh_hans: 语言

# settings.note
source: Animation is purely performative — the hexagram is always deterministically computed by the local engine.
zh_hans: 动画为表演性质 — 卦象始终由本地引擎确定性计算。

# settings.reduceMotionNotice
source: Reduce Motion is enabled. Animation will be downgraded.
zh_hans: 系统「减弱动态效果」已开启，动画已降级。

# settings.shakeSection
source: Shake Casting
zh_hans: 摇一摇起卦

# settings.shakeToToss
source: Shake to Cast
zh_hans: 摇一摇起卦

# settings.skipAnimation
source: Skip Divination Animation
zh_hans: 跳过起卦动画
